import product0 from"../material/products/products_0.png";
import product1 from"../material/products/products_1.png";
import product2 from"../material/products/products_2.png";
import product0_1 from "../material/products/products_0_1.png";
import product0_2 from "../material/products/products_0_2.png";
import product1alt from"../material/products/products_1alt.png";
import product1_1 from "../material/products/products_1_1.png";
import product1_2 from "../material/products/products_1_2.png";
import product2_1 from "../material/products/products_2_1.png";
import product2_2 from "../material/products/products_2_2.png"; 
export const products = [
  { id: 0, 
    name: "夜月幽焰茶",
    image:product0,
    packages:[],
    detailImages:[product0_1,product0_2],
    filter:["平素","提神","聯名特品"],
    subtitle: "冥火淬焙、亙古不熄", 
    description:`第一層：靜謐之月（外觀與初響）
                  這款茶起源於遠古的靜謐傳說。深邃如夜的茶盒中，封存的是歲月的餘燼。當熱水注入，蜷縮的茶葉在杯中舒展開來，猶如暗夜中被月光點燃的古木。

                  專屬俳句：

                  清輝映古木，
                  夜色沈入杯底間，
                  幽火寂無聲。

                  第二層：幽焰之魂（烘焙與工藝）
                  「夜月幽焰」並非尋常炭焙，而是採集高山稀有木材，在月升之時進行「冥火淬焙」。這種獨特的控溫技術，去除了苦澀的躁動，留下的只有如地核深處湧動的溫潤暖意。每一口茶湯，都帶著一絲若有似無的煙燻香氣，那是火與葉在漫長時光中達成的終極和解。

                  專屬俳句：

                  冥火淬餘燼，
                  焙入百年孤獨味，
                  茶香繞指尖。

                  第三層：亙古不熄（口感與餘味）
                  入口後，茶湯滑順如絲緞，醇厚的層次感在舌根徐徐綻放。那種飽滿的熟果韻味與木質調，在口中久久不散，彷彿那團幽火依然在感官深處低迴。這不只是一杯茶，這是一場關於時間與寂靜的儀式。

                  專屬俳句：

                  盞中不凋火，
                  一飲萬世塵囂盡，
                  心境自清明。

                  產品資訊
                  售價： $12.99

                  產地意象： 來自古林的神祕獻禮，跨越時空的火之藝術。

                  建議飲用： 適合在深夜靜讀，或是在需要沉澱心靈的時刻細細品味。`,
    price: '$12.99' },
  {
    id:1,
    name:"千鶴幽青茶",
    image:product1,
    packages:[product1alt],
    detailImages:[product1_1,product1_2],
    filter:["精緻","養生","聯名特品"],
    subtitle: "幽山長遠、林霧恆存", 
    description:`第一層：靜謐之月（外觀與初響）
                  這款茶起源於遠古的靜謐傳說。深邃如夜的茶盒中，封存的是歲月的餘燼。當熱水注入，蜷縮的茶葉在杯中舒展開來，猶如暗夜中被月光點燃的古木。

                  專屬俳句：

                  清輝映古木，
                  夜色沈入杯底間，
                  幽火寂無聲。

                  第二層：幽焰之魂（烘焙與工藝）
                  「夜月幽焰」並非尋常炭焙，而是採集高山稀有木材，在月升之時進行「冥火淬焙」。這種獨特的控溫技術，去除了苦澀的躁動，留下的只有如地核深處湧動的溫潤暖意。每一口茶湯，都帶著一絲若有似無的煙燻香氣，那是火與葉在漫長時光中達成的終極和解。

                  專屬俳句：

                  冥火淬餘燼，
                  焙入百年孤獨味，
                  茶香繞指尖。

                  第三層：亙古不熄（口感與餘味）
                  入口後，茶湯滑順如絲緞，醇厚的層次感在舌根徐徐綻放。那種飽滿的熟果韻味與木質調，在口中久久不散，彷彿那團幽火依然在感官深處低迴。這不只是一杯茶，這是一場關於時間與寂靜的儀式。

                  專屬俳句：

                  盞中不凋火，
                  一飲萬世塵囂盡，
                  心境自清明。

                  產品資訊
                  售價： $12.99

                  產地意象： 來自古林的神祕獻禮，跨越時空的火之藝術。

                  建議飲用： 適合在深夜靜讀，或是在需要沉澱心靈的時刻細細品味。`,
    price: '$12.99' 
  },
  {
    id:2,
    name:"綠茶",
    image:product2,
    packages:[],
    detailImages:[product2_1,product2_2],
    filter:["平素","養生","聯名特品"],
    subtitle: "幽山長遠、林霧恆存", 
    description:`第一層：靜謐之月（外觀與初響）
                  這款茶起源於遠古的靜謐傳說。深邃如夜的茶盒中，封存的是歲月的餘燼。當熱水注入，蜷縮的茶葉在杯中舒展開來，猶如暗夜中被月光點燃的古木。

                  專屬俳句：

                  清輝映古木，
                  夜色沈入杯底間，
                  幽火寂無聲。

                  第二層：幽焰之魂（烘焙與工藝）
                  「夜月幽焰」並非尋常炭焙，而是採集高山稀有木材，在月升之時進行「冥火淬焙」。這種獨特的控溫技術，去除了苦澀的躁動，留下的只有如地核深處湧動的溫潤暖意。每一口茶湯，都帶著一絲若有似無的煙燻香氣，那是火與葉在漫長時光中達成的終極和解。

                  專屬俳句：

                  冥火淬餘燼，
                  焙入百年孤獨味，
                  茶香繞指尖。

                  第三層：亙古不熄（口感與餘味）
                  入口後，茶湯滑順如絲緞，醇厚的層次感在舌根徐徐綻放。那種飽滿的熟果韻味與木質調，在口中久久不散，彷彿那團幽火依然在感官深處低迴。這不只是一杯茶，這是一場關於時間與寂靜的儀式。

                  專屬俳句：

                  盞中不凋火，
                  一飲萬世塵囂盡，
                  心境自清明。

                  產品資訊
                  售價： $12.99

                  產地意象： 來自古林的神祕獻禮，跨越時空的火之藝術。

                  建議飲用： 適合在深夜靜讀，或是在需要沉澱心靈的時刻細細品味。`,
    price: '$12.99' 
  }
];
export const filter=[
  {type:"包裝",
    options:["平素","精緻"]
  },
  {type:"功效",
    options:["助眠","提神","消化","養生"]
  },
  {type:"形式",
    options:["粉末","茶包","葉片","甜點","用品"]
  },
  {type:"咖啡因",
    options:["有咖啡因","無咖啡因"]
  },
  {type:"特選系列",
    options:["聯名特品","當期優惠"]
  }
];
export const sort =[
  "價格高至低",
  "價格低至高",
  "上架新至舊",
  "上架舊至新"
];